#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/rg-terraform-web-sql-db]
azurerm_service_plan.app_plan: Refreshing state... [id=/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/serverfarms/appserviceplan-web-21]
azurerm_app_service.webapp: Refreshing state... [id=/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/sites/terraform-web-021]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_app_service.webapp has changed
  ~ resource "azurerm_app_service" "webapp" {
        id                                = "/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/sites/terraform-web-021"
        name                              = "terraform-web-021"
      + tags                              = {}
        # (17 unchanged attributes hidden)




      ~ site_config {
          + default_documents                    = []
            # (18 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # azurerm_service_plan.app_plan has changed
  ~ resource "azurerm_service_plan" "app_plan" {
        id                           = "/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/serverfarms/appserviceplan-web-21"
        name                         = "appserviceplan-web-21"
      + tags                         = {}
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/rg-terraform-web-sql-db"
        name     = "rg-terraform-web-sql-db"
      ~ tags     = {
          ~ "environment" = "production" -> "preproduction"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_sql_database.db will be created
  + resource "azurerm_sql_database" "db" {
      + collation                        = (known after apply)
      + create_mode                      = "Default"
      + creation_date                    = (known after apply)
      + default_secondary_location       = (known after apply)
      + edition                          = (known after apply)
      + elastic_pool_name                = (known after apply)
      + encryption                       = (known after apply)
      + id                               = (known after apply)
      + location                         = "northeurope"
      + max_size_bytes                   = (known after apply)
      + max_size_gb                      = (known after apply)
      + name                             = "terraform-sqldatabase20"
      + read_scale                       = false
      + requested_service_objective_id   = (known after apply)
      + requested_service_objective_name = (known after apply)
      + resource_group_name              = "rg-terraform-web-sql-db"
      + restore_point_in_time            = (known after apply)
      + server_name                      = "terraform-sqlserver-021"
      + source_database_deletion_date    = (known after apply)
      + source_database_id               = (known after apply)

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
        }
    }

  # azurerm_sql_server.sqldb will be created
  + resource "azurerm_sql_server" "sqldb" {
      + administrator_login          = "user01"
      + administrator_login_password = (sensitive value)
      + connection_policy            = "Default"
      + fully_qualified_domain_name  = (known after apply)
      + id                           = (known after apply)
      + location                     = "northeurope"
      + name                         = "terraform-sqlserver-021"
      + resource_group_name          = "rg-terraform-web-sql-db"
      + version                      = "12.0"

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Deprecated Resource

  with azurerm_app_service.webapp,
  on main.tf line 18, in resource "azurerm_app_service" "webapp":
  18: resource "azurerm_app_service" "webapp" {

The `azurerm_app_service` resource has been superseded by the
`azurerm_linux_web_app` and `azurerm_windows_web_app` resources. Whilst this
resource will continue to be available in the 2.x and 3.x releases it is
feature-frozen for compatibility purposes, will no longer receive any updates
and will be removed in a future major release of the Azure Provider.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @HoussemDellai, Action: `pull_request`, Working Directory: ``, Workflow: `Create Infra with Terraform`*